eduxstad/cc1310f128-rs/cc1310f128.svd
AON Event Source selecting 1 of 4 events routed to AON_WUC for waking up the MCU domain from Power Off or Power Down.
Note:</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>63</value>
                  <description>No event, always low</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB_ASYNC_N</name>
                  <value>56</value>
                  <description>Comparator B not triggered. Asynchronous signal directly from AUX Comparator B (inverted) as opposed to AUX_COMPB which is synchronized in AUX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB_ASYNC</name>
                  <value>55</value>
                  <description>Comparator B triggered. Asynchronous signal directly from the AUX Comparator B as opposed to AUX_COMPB which is synchronized in AUX</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_VOLT</name>
                  <value>54</value>
                  <description>BATMON voltage update event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_TEMP</name>
                  <value>53</value>
                  <description>BATMON temperature update event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER1_EV</name>
                  <value>52</value>
                  <description>AUX Timer 1 Event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER0_EV</name>
                  <value>51</value>
                  <description>AUX Timer 0 Event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TDC_DONE</name>
                  <value>50</value>
                  <description>TDC completed or timed out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_DONE</name>
                  <value>49</value>
                  <description>ADC conversion completed</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <value>48</value>
                  <description>Comparator B triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <value>47</value>
                  <description>Comparator A triggered</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SWEV2</name>
                  <value>46</value>
                  <description>AUX Software triggered event #2. Triggered by AUX_EVCTL:SWEVSET.SWEV2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SWEV1</name>
                  <value>45</value>
                  <description>AUX Software triggered event #1. Triggered by AUX_EVCTL:SWEVSET.SWEV1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SWEV0</name>
                  <value>44</value>
                  <description>AUX Software triggered event #0. Triggered by AUX_EVCTL:SWEVSET.SWEV0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JTAG</name>
                  <value>43</value>
                  <description>JTAG generated event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_UPD</name>
                  <value>42</value>
                  <description>RTC Update Tick (16 kHz signal, i.e. event line toggles value every 32 kHz clock period)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_COMB_DLY</name>
                  <value>41</value>
                  <description>RTC combined delayed event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH2_DLY</name>
                  <value>40</value>
                  <description>RTC channel 2 - delayed event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH1_DLY</name>
                  <value>39</value>
                  <description>RTC channel 1 - delayed event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH0_DLY</name>
                  <value>38</value>
                  <description>RTC channel 0 - delayed event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH2</name>
                  <value>37</value>
                  <description>RTC channel 2 event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH1</name>
                  <value>36</value>
                  <description>RTC channel 1 event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CH0</name>
                  <value>35</value>
                  <description>RTC channel 0 event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD</name>
                  <value>32</value>
                  <description>Edge detect on any PAD</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD31</name>
                  <value>31</value>
                  <description>Edge detect on PAD31</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD30</name>
                  <value>30</value>
                  <description>Edge detect on PAD30</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD29</name>
                  <value>29</value>
                  <description>Edge detect on PAD29</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD28</name>
                  <value>28</value>
                  <description>Edge detect on PAD28</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD27</name>
                  <value>27</value>
                  <description>Edge detect on PAD27</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD26</name>
                  <value>26</value>
                  <description>Edge detect on PAD26</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD25</name>
                  <value>25</value>
                  <description>Edge detect on PAD25</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD24</name>
                  <value>24</value>
                  <description>Edge detect on PAD24</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD23</name>
                  <value>23</value>
                  <description>Edge detect on PAD23</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD22</name>
                  <value>22</value>
                  <description>Edge detect on PAD22</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD21</name>
                  <value>21</value>
                  <description>Edge detect on PAD21</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD20</name>
                  <value>20</value>
                  <description>Edge detect on PAD20</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD19</name>
                  <value>19</value>
                  <description>Edge detect on PAD19</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD18</name>
                  <value>18</value>
                  <description>Edge detect on PAD18</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD17</name>
                  <value>17</value>
                  <description>Edge detect on PAD17</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD16</name>
                  <value>16</value>
                  <description>Edge detect on PAD16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD15</name>
                  <value>15</value>
                  <description>Edge detect on PAD15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD14</name>
                  <value>14</value>
                  <description>Edge detect on PAD14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD13</name>
                  <value>13</value>
                  <description>Edge detect on PAD13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD12</name>
                  <value>12</value>
                  <description>Edge detect on PAD12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD11</name>
                  <value>11</value>
                  <description>Edge detect on PAD11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD10</name>
                  <value>10</value>
                  <description>Edge detect on PAD10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD9</name>
                  <value>9</value>
                  <description>Edge detect on PAD9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD8</name>
                  <value>8</value>
                  <description>Edge detect on PAD8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD7</name>
                  <value>7</value>
                  <description>Edge detect on PAD7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD6</name>
                  <value>6</value>
                  <description>Edge detect on PAD6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD5</name>
                  <value>5</value>
                  <description>Edge detect on PAD5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD4</name>
                  <value>4</value>
                  <description>Edge detect on PAD4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD3</name>
                  <value>3</value>
                  <description>Edge detect on PAD3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD2</name>
                  <value>2</value>
                  <description>Edge detect on PAD2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD1</name>
                  <value>1</value>
                  <description>Edge detect on PAD1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD0</name>
                  <value>0</value>
                  <description>Edge detect on PAD0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x3F3F3F3F</resetValue>
        </register>
        <register>
          <name>AUXWUSEL</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Wake-up Selector For AUX

This register contains pointers to 3 events which are routed to AON_WUC as wakeup sources for AUX. AON_WUC will start a wakeup sequence for the AUX domain when either of the 3 selected events are asserted. A wakeup sequence will guarantee that the AUX power switches are turned on, LDO resources are available and SCLK_HF is available and selected as clock source for AUX.

Note: It is recommended ( or required when AON_WUC:AUXCLK.PWR_DWN_SRC=NONE) to also setup a wakeup event here before AUX is requesting powerdown. ( AUX_WUC:PWRDWNREQ.REQ is asserted] ) as it will speed up the wakeup procedure.</description>
          <fields>
            <field>
              <name>RESERVED22</name>
              <description>[31:22] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>10</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>WU2_EV</name>
              <description>[21:16] AUX Wakeup Source #2

