eduxstad/cc1310f128-rs/cc1310f128.svd
The compare value is compared against SEC.VALUE (15:0) and SUBSEC.VALUE (31:16) values of the Real Time Clock register. A Cannel 0 event is generated when {SEC.VALUE(15:0),SUBSEC.VALUE (31:16)} is reaching or exciting the compare value. 

Writing to this register can trigger an immediate*) event in case the new compare value matches a Real Time Clock  value from 1 second in the past up till current Real Time Clock value.

Example:
To generate a compare  5.5 seconds RTC start,- set this value = 0x0005_8000

*) It can take up to 2 SCLK_LF clock cycles before event occurs due to synchronization.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CH1CMP</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Channel 1 Compare Value</description>
          <fields>
            <field>
              <name>VALUE</name>
              <description>[31:0] RTC Channel 1 compare value.

Bit 31 to 16 represents seconds and bits 15 to 0 represents subseconds of the compare value.

The compare value is compared against SEC.VALUE (15:0) and SUBSEC.VALUE (31:16) values of the Real Time Clock register. A Cannel 0 event is generated when {SEC.VALUE(15:0),SUBSEC.VALUE (31:16)} is reaching or exciting the compare value. 

Writing to this register can trigger an immediate*) event in case the new compare value matches a Real Time Clock  value from 1 second in the past up till current Real Time Clock value.

Example:
To generate a compare  5.5 seconds RTC start,- set this value = 0x0005_8000

*) It can take up to 2 SCLK_LF clock cycles before event occurs due to synchronization.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CH2CMP</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Channel 2 Compare Value</description>
          <fields>
            <field>
              <name>VALUE</name>
              <description>[31:0] RTC Channel 2 compare value.

Bit 31 to 16 represents seconds and bits 15 to 0 represents subseconds of the compare value.

The compare value is compared against SEC.VALUE (15:0) and SUBSEC.VALUE (31:16) values of the Real Time Clock register. A Cannel 0 event is generated when {SEC.VALUE(15:0),SUBSEC.VALUE (31:16)} is reaching or exciting the compare value. 

Writing to this register can trigger an immediate*) event in case the new compare value matches a Real Time Clock  value from 1 second in the past up till current Real Time Clock value.

Example:
To generate a compare  5.5 seconds RTC start,- set this value = 0x0005_8000

*) It can take up to 2 SCLK_LF clock cycles before event occurs due to synchronization.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CH2CMPINC</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Channel 2 Compare Value Auto-increment

This register is primarily used to generate periodical wake-up for the AUX_SCE module, through the [AUX_EVCTL.EVSTAT0.AON_RTC] event.</description>
          <fields>
            <field>
              <name>VALUE</name>
              <description>[31:0] If CHCTL.CH2_CONT_EN is set, this value is added to CH2CMP.VALUE on every channel 2 compare event.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CH1CAPT</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Channel 1 Capture Value

If CHCTL.CH1_EN = 1and CHCTL.CH1_CAPT_EN = 1, capture occurs on each rising edge of the event selected in AON_EVENT:RTCSEL.</description>
          <fields>
            <field>
              <name>SEC</name>
              <description>[31:16] Value of SEC.VALUE bits 15:0 at capture time.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>SUBSEC</name>
              <description>[15:0] Value of SUBSEC.VALUE bits 31:16 at capture time.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SYNC</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>AON Synchronization

This register is used for synchronizing between MCU and entire AON domain.</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>WBUSY</name>
              <description>[0:0] This register will always return 0,- however it will not return the value until there are no outstanding write requests between MCU and AON

Note: Writing to this register prior to reading will force a wait until next SCLK_LF  edge. This is recommended for syncing read registers from AON when waking up from sleep
Failure to do so may result in reading AON values from prior to going to sleep</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
