eduxstad/cc1310f128-rs/cc1310f128.svd
Reading 0 means that there is no outstanding software event for AUX. 

Note that it can take up to 1,5 SCLK_LF clock cycles to clear the event from AUX.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>AUX_FORCE_ON</name>
              <description>[0:0] Forces the AUX domain into active mode, overriding the requests from AUX_WUC:PWROFFREQ, AUX_WUC:PWRDWNREQ and AUX_WUC:MCUBUSCTL. 
Note that an ongoing AUX_WUC:PWROFFREQ will complete before this bit will set the AUX domain into active mode.

MCU must set this bit in order to access the AUX peripherals. 
The AUX domain status can be read from PWRSTAT.AUX_PD_ON 

0: AUX is allowed to Power Off, Power Down or Disconnect.
1: AUX  Power OFF, Power Down or Disconnect requests will be overruled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PWRSTAT</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Power Status

This register is used to monitor various power management related signals in AON.  Most signals are for test, calibration and debug purpose only, and others can be used to detect that AUX or JTAG domains are powered up.</description>
          <fields>
            <field>
              <name>RESERVED10</name>
              <description>[31:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>22</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>AUX_PWR_DWN</name>
              <description>[9:9] Indicates the AUX powerdown state when AUX domain is powered up.

0: Active mode
1: AUX Powerdown request has been granted</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[8:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>JTAG_PD_ON</name>
              <description>[6:6] Indicates JTAG power state:

0: JTAG is powered off
1: JTAG is powered on</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>AUX_PD_ON</name>
              <description>[5:5] Indicates AUX power state:

0: AUX is not ready for use ( may be powered off or in power state transition )
1: AUX is powered on, connected to bus and ready for use,</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MCU_PD_ON</name>
              <description>[4:4] Indicates MCU power state:

0: MCU Power sequencing is not yet finalized and MCU_AONIF registers may not be reliable
1: MCU Power sequencing is finalized and all MCU_AONIF registers are reliable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[3:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>AUX_BUS_CONNECTED</name>
              <description>[2:2] Indicates that AUX Bus is connected:

0: AUX bus is not connected
1: AUX bus is connected ( idle_ack = 0 )</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AUX_RESET_DONE</name>
              <description>[1:1] Indicates Reset Done from AUX:

0: AUX is being reset
1: AUX reset is released</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x3800000</resetValue>
        </register>
        <register>
          <name>SHUTDOWN</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Shutdown Control

This register contains bitfields required for entering shutdown mode</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Writing a 1 to this bit forces a shutdown request to be registered and all I/O values to be latched - in the PAD ring, possibly enabling I/O wakeup. Writing 0 will cancel a registered shutdown request and open th I/O latches residing in the PAD ring.

A registered shutdown request takes effect the next time power down conditions exists. At this time, the will not enter Powerdown mode, but instead it will turn off all internal powersupplies, effectively putting the device into Shutdown mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CTL0</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Control 0

This register contains various chip level control and debug bitfields.</description>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PWR_DWN_DIS</name>
              <description>[8:8] Controls whether MCU and AUX requesting to be powered off will enable a transition to powerdown:

0: Enabled
1: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[7:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>AUX_SRAM_ERASE</name>
              <description>[3:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MCU_SRAM_ERASE</name>
              <description>[2:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[1:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CTL1</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Control 1

This register contains various chip level control and debug bitfields.</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MCU_RESET_SRC</name>
              <description>[1:1] Indicates source of last MCU Voltage Domain warm reset request:

0: MCU SW reset
1: JTAG reset

This bit can only be cleared by writing a 1 to it</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MCU_WARM_RESET</name>
              <description>[0:0] Indicates type of last MCU Voltage Domain reset:

0: Last MCU reset was not a warm reset
1: Last MCU reset was a warm reset (requested from MCU or JTAG as indicated in MCU_RESET_SRC)

This bit can only be cleared by writing a 1 to it</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RECHARGECFG</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Recharge Controller Configuration

