eduxstad/cc1310f128-rs/cc1310f128.svd
This register sets all relevant patameters for controlling the recharge algorithm.</description>
          <fields>
            <field>
              <name>ADAPTIVE_EN</name>
              <description>[31:31] Enable adaptive recharge

Note: Recharge can be turned completely of by setting MAX_PER_E=7 and MAX_PER_M=31 and this bitfield to 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>RESERVED24</name>
              <description>[30:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>C2</name>
              <description>[23:20] Gain factor for adaptive recharge algorithm

period_new=period * ( 1+/-(2^-C1+2^-C2) )
Valid values for C2 is 2 to 10

Note: Rounding may cause adaptive recharge not to start for very small values of both Gain and Initial period. Criteria for algorithm to start is MAX(PERIOD*2^-C1,PERIOD*2^-C2) >= 1</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>C1</name>
              <description>[19:16] Gain factor for adaptive recharge algorithm

period_new=period * ( 1+/-(2^-C1+2^-C2) )
Valid values for C1 is 1 to 10

Note: Rounding may cause adaptive recharge not to start for very small values of both Gain and Initial period. Criteria for algorithm to start is MAX(PERIOD*2^-C1,PERIOD*2^-C2) >= 1</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>MAX_PER_M</name>
              <description>[15:11] This register defines the maximum period that the recharge algorithm can take, i.e. it defines  the maximum number of cycles between 2 recharges.
The maximum number of cycles is specified with a 5 bit mantissa and 3 bit exponent:
MAXCYCLES=(MAX_PER_M*16+15)*2^MAX_PER_E
This field sets the mantissa of MAXCYCLES</description>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>MAX_PER_E</name>
              <description>[10:8] This register defines the maximum period that the recharge algorithm can take, i.e. it defines  the maximum number of cycles between 2 recharges.
The maximum number of cycles is specified with a 5 bit mantissa and 3 bit exponent:
MAXCYCLES=(MAX_PER_M*16+15)*2^MAX_PER_E
This field sets the exponent MAXCYCLES</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PER_M</name>
              <description>[7:3] Number of 32 KHz clocks between activation of recharge controller
For recharge algorithm, PERIOD is the initial period when entering powerdown mode. The adaptive recharge algorithm will not change this register
PERIOD will effectively be a 16 bit value coded in a 5 bit mantissa and 3 bit exponent:
This field sets the Mantissa of the Period.
PERIOD=(PER_M*16+15)*2^PER_E</description>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PER_E</name>
              <description>[2:0] Number of 32 KHz clocks between activation of recharge controller
For recharge algorithm, PERIOD is the initial period when entering powerdown mode. The adaptive recharge algorithm will not change this register
PERIOD will effectively be a 16 bit value coded in a 5 bit mantissa and 3 bit exponent:
This field sets the Exponent of the Period.  
PERIOD=(PER_M*16+15)*2^PER_E</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RECHARGESTAT</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Recharge Controller Status

This register controls various status registers which are updated during recharge.  The register is mostly intended for test and debug.</description>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>[31:20] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>VDDR_SMPLS</name>
              <description>[19:16] The last 4 VDDR samples, bit 0 being the newest.

The register is being updated in every recharge period with a shift left, and bit 0 is updated with the last VDDR sample, ie a 1 is shiftet in in case VDDR > VDDR_threshold just before recharge starts. Otherwise a 0 will be shifted in.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>MAX_USED_PER</name>
              <description>[15:0] The maximum value of recharge period seen with VDDR>threshold.

The VDDR voltage is compared against the threshold voltage at  just before  each recharge. If VDDR is above threshold, MAX_USED_PER is updated with max ( current recharge peride; MAX_USED_PER )  This way MAX_USED_PER can track the recharge period where VDDR is decharged to the threshold value. We can therefore use the value as an indication of the leakage current during recharge.

This bitfield is cleared to 0 when writing this register.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>OSCCFG</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Oscillator Configuration

