eduxstad/cc1310f128-rs/cc1310f128.svd
Set software event flags from AUX domain to AON and MCU domains. CPUs in MCU domain can read the event flags from EVTOAONFLAGS and clear them in EVTOAONFLAGSCLR. 

Use of these event flags is software-defined.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SWEV2</name>
              <description>[2:2] Software event flag 2.

0: No effect.
1: Set software event flag 2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SWEV1</name>
              <description>[1:1] Software event flag 1.

0: No effect.
1: Set software event flag 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SWEV0</name>
              <description>[0:0] Software event flag 0.

0: No effect.
1: Set software event flag 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVSTAT0</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Event Status 0

Register holds events 0 thru 15 of the 32-bit event bus that is synchronous to AUX clock. The following subscribers use the asynchronous version of events in this register.
- AUX_ANAIF.
- AUX_TDC.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>AUXIO2</name>
              <description>[15:15] AUXIO2   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>AUXIO1</name>
              <description>[14:14] AUXIO1   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>AUXIO0</name>
              <description>[13:13] AUXIO0   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>AON_PROG_WU</name>
              <description>[12:12] AON_EVENT:AUXWUSEL.WU2_EV OR AON_EVENT:AUXWUSEL.WU1_EV OR AON_EVENT:AUXWUSEL.WU0_EV</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>AON_SW</name>
              <description>[11:11] AON_WUC:AUXCTL.SWEV</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>OBSMUX1</name>
              <description>[10:10] Observation input 1 from IOC. 
This event is configured by IOC:OBSAUXOUTPUT.SEL1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>OBSMUX0</name>
              <description>[9:9] Observation input 0 from IOC. 
This event is configured by IOC:OBSAUXOUTPUT.SEL0 and can be overridden by IOC:OBSAUXOUTPUT.SEL_MISC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>ADC_FIFO_ALMOST_FULL</name>
              <description>[8:8] AUX_ANAIF:ADCFIFOSTAT.ALMOST_FULL</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ADC_DONE</name>
              <description>[7:7] AUX_ANAIF ADC conversion done event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>SMPH_AUTOTAKE_DONE</name>
              <description>[6:6] See AUX_SMPH:AUTOTAKE.SMPH_ID for description.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>TIMER1_EV</name>
              <description>[5:5] AUX_TIMER1_EV event, see AUX_TIMER:T1TARGET for description.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>TIMER0_EV</name>
              <description>[4:4] AUX_TIMER0_EV event, see AUX_TIMER:T0TARGET for description.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>TDC_DONE</name>
              <description>[3:3] AUX_TDC:STAT.DONE</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>[2:2] Comparator B output</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>[1:1] Comparator A output</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>AON_RTC_CH2</name>
              <description>[0:0] AON_RTC:EVFLAGS.CH2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVSTAT1</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Event Status 1

Current event source levels, 31:16</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>ADC_IRQ</name>
              <description>[15:15] The logical function for this event is configurable.

