eduxstad/cc1310f128-rs/cc1310f128.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_TIPROP</name>
      <baseAddress>0xE00FE000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Cortex-M's TI proprietary registers</description>
      <registers>
        <register>
          <name>RESERVED000</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TRACECLKMUX</name>
          <addressOffset>0xff8</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>TRACECLK_N_SWV</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRACECLK</name>
                  <value>1</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWV</name>
                  <value>0</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DYN_CG</name>
          <addressOffset>0xffc</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DYN_CG</name>
              <description>[1:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_TPIU</name>
      <baseAddress>0xE0040000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Cortex-M3's Trace Port Interface Unit (TPIU)</description>
      <registers>
        <register>
          <name>SSPSR</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Supported Sync Port Sizes
This register represents a single port size that is supported on the device, that is, 4, 2 or 1. This is to ensure that tools do not attempt to select a port width that an attached TPA cannot capture.</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>FOUR</name>
              <description>[3:3] 4-bit port size support

0x0: Not supported
0x1: Supported</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>THREE</name>
              <description>[2:2] 3-bit port size support

0x0: Not supported
0x1: Supported</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TWO</name>
              <description>[1:1] 2-bit port size support

0x0: Not supported
0x1: Supported</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ONE</name>
              <description>[0:0] 1-bit port size support

0x0: Not supported
0x1: Supported</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>CSPSR</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Current Sync Port Size
This register has the same format as SSPSR but only one bit can be set, and all others must be zero. Writing values with more than one bit set, or setting a bit that is not indicated as supported can cause Unpredictable behavior. On reset this defaults to the smallest possible port size, 1 bit.</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>FOUR</name>
              <description>[3:3] 4-bit port enable
Writing values with more than one bit set in CSPSR, or setting a bit that is not indicated as supported in SSPSR can cause Unpredictable behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>THREE</name>
              <description>[2:2] 3-bit port enable
Writing values with more than one bit set in CSPSR, or setting a bit that is not indicated as supported in SSPSR can cause Unpredictable behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TWO</name>
              <description>[1:1] 2-bit port enable
Writing values with more than one bit set in CSPSR, or setting a bit that is not indicated as supported in SSPSR can cause Unpredictable behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ONE</name>
              <description>[0:0] 1-bit port enable
Writing values with more than one bit set in CSPSR, or setting a bit that is not indicated as supported in SSPSR can cause Unpredictable behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>ACPR</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Async Clock Prescaler
This register scales the baud rate of the asynchronous output.</description>
          <fields>
            <field>
              <name>RESERVED13</name>
              <description>[31:13] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>19</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PRESCALER</name>
              <description>[12:0] Divisor for input trace clock is (PRESCALER + 1).</description>
              <bitWidth>13</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SPPR</name>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <description>Selected Pin Protocol
This register selects the protocol to be used for trace output. 
Note: If this register is changed while trace data is being output, data corruption occurs.</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PROTOCOL</name>
              <description>[1:0] Trace output protocol</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWO_NRZ</name>
                  <value>2</value>
                  <description>SerialWire Output (NRZ)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWO_MANCHESTER</name>
                  <value>1</value>
                  <description>SerialWire Output (Manchester). This is the reset value.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACEPORT</name>
                  <value>0</value>
                  <description>TracePort mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>FFSR</name>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <description>Formatter and Flush Status</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>FTNONSTOP</name>
              <description>[3:3] 0: Formatter can be stopped
1: Formatter cannot be stopped</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[2:0] This field always reads as zero</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x8</resetValue>
        </register>
        <register>
          <name>FFCR</name>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <description>Formatter and Flush Control
When one of the two single wire output (SWO) modes is selected, ENFCONT enables the formatter to be bypassed. If the formatter is bypassed, only the ITM/DWT trace source (ATDATA2) passes through. The TPIU accepts and discards data that is presented on the ETM port (ATDATA1). This function is intended to be used when it is necessary to connect a device containing an ETM to a trace capture device that is only able to capture Serial Wire Output (SWO) data. Enabling or disabling the formatter causes momentary data corruption. 
Note: If the selected pin protocol register (SPPR.PROTOCOL) is set to 0x00 (TracePort mode), this register always reads 0x102, because the formatter is automatically enabled. If one of the serial wire modes is then selected, the register reverts to its previously programmed value.</description>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>TRIGIN</name>
              <description>[8:8] Indicates that triggers are inserted when a trigger pin is asserted.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[7:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ENFCONT</name>
              <description>[1:1] Enable continuous formatting:

