eduxstad/cc1310f128-rs/cc1310f128.svd
        <register>
          <name>UDMACH1BSEL</name>
          <addressOffset>0x50c</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 1 REQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_RX_DMABREQ</name>
                  <value>48</value>
                  <description>UART0 RX DMA burst request, controlled by UART0:DMACTL.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x30</resetValue>
        </register>
        <register>
          <name>UDMACH2SSEL</name>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 2 SREQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_TX_DMASREQ</name>
                  <value>51</value>
                  <description>UART0 TX DMA single request, controlled by UART0:DMACTL.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x33</resetValue>
        </register>
        <register>
          <name>UDMACH2BSEL</name>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 2 REQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_TX_DMABREQ</name>
                  <value>50</value>
                  <description>UART0 TX DMA burst request, controlled by UART0:DMACTL.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x32</resetValue>
        </register>
        <register>
          <name>UDMACH3SSEL</name>
          <addressOffset>0x518</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 3 SREQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI0_RX_DMASREQ</name>
                  <value>41</value>
                  <description>SSI0 RX DMA single request, controlled by SSI0:DMACR.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x29</resetValue>
        </register>
        <register>
          <name>UDMACH3BSEL</name>
          <addressOffset>0x51c</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 3 REQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI0_RX_DMABREQ</name>
                  <value>40</value>
                  <description>SSI0 RX DMA burst request , controlled by SSI0:DMACR.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x28</resetValue>
        </register>
        <register>
          <name>UDMACH4SSEL</name>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 4 SREQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI0_TX_DMASREQ</name>
                  <value>43</value>
                  <description>SSI0 TX DMA single request, controlled by SSI0:DMACR.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x2B</resetValue>
        </register>
        <register>
          <name>UDMACH4BSEL</name>
          <addressOffset>0x524</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 4 REQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI0_TX_DMABREQ</name>
                  <value>42</value>
                  <description>SSI0 TX DMA burst request , controlled by SSI0:DMACR.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x2A</resetValue>
        </register>
        <register>
          <name>UDMACH5SSEL</name>
          <addressOffset>0x528</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 5 SREQ</description>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x3A</resetValue>
        </register>
        <register>
          <name>UDMACH5BSEL</name>
          <addressOffset>0x52c</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 5 REQ</description>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x39</resetValue>
        </register>
        <register>
          <name>UDMACH6SSEL</name>
          <addressOffset>0x530</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 6 SREQ</description>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x3C</resetValue>
        </register>
        <register>
          <name>UDMACH6BSEL</name>
          <addressOffset>0x534</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 6 REQ</description>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x3B</resetValue>
        </register>
        <register>
          <name>UDMACH7SSEL</name>
          <addressOffset>0x538</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 7 SREQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_DMASREQ</name>
                  <value>117</value>
                  <description>DMA single request event from AUX, configured by AUX_EVCTL:DMACTL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x75</resetValue>
        </register>
        <register>
          <name>UDMACH7BSEL</name>
          <addressOffset>0x53c</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 7 REQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_DMABREQ</name>
                  <value>118</value>
                  <description>DMA burst request event from AUX, configured by AUX_EVCTL:DMACTL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x76</resetValue>
        </register>
        <register>
          <name>UDMACH8SSEL</name>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 8 SREQ

Single request is ignored for this channel</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_SW_DMABREQ</name>
                  <value>116</value>
                  <description>DMA sofware trigger from AUX, triggered by AUX_EVCTL:DMASWREQ.START</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x74</resetValue>
        </register>
        <register>
          <name>UDMACH8BSEL</name>
          <addressOffset>0x544</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 8 REQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_SW_DMABREQ</name>
                  <value>116</value>
                  <description>DMA sofware trigger from AUX, triggered by AUX_EVCTL:DMASWREQ.START</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x74</resetValue>
        </register>
        <register>
          <name>UDMACH9SSEL</name>
          <addressOffset>0x548</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 9 SREQ

