eduxstad/cc1310f128-rs/cc1310f128.svd
Writing any other value than values defined by a ENUM may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <value>121</value>
                  <description>Always asserted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_HALTED</name>
                  <value>120</value>
                  <description>CPU halted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_UPD</name>
                  <value>119</value>
                  <description>RTC periodic event controlled by AON_RTC:CTL.RTC_UPD_EN</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_DMABREQ</name>
                  <value>118</value>
                  <description>DMA burst request event from AUX, configured by AUX_EVCTL:DMACTL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_DMASREQ</name>
                  <value>117</value>
                  <description>DMA single request event from AUX, configured by AUX_EVCTL:DMACTL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SW_DMABREQ</name>
                  <value>116</value>
                  <description>DMA sofware trigger from AUX, triggered by AUX_EVCTL:DMASWREQ.START</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_IRQ</name>
                  <value>115</value>
                  <description>AUX ADC interrupt event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.ADC_IRQ. Status flags are found here AUX_EVCTL:EVTOMCUFLAGS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_OBSMUX0</name>
                  <value>114</value>
                  <description>Loopback of OBSMUX0 through AUX, corresponds to AUX_EVCTL:EVTOMCUFLAGS.OBSMUX0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_FIFO_ALMOST_FULL</name>
                  <value>113</value>
                  <description>AUX ADC FIFO watermark event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.ADC_FIFO_ALMOST_FULL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_DONE</name>
                  <value>112</value>
                  <description>AUX ADC done, corresponds to AUX_EVCTL:EVTOMCUFLAGS.ADC_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SMPH_AUTOTAKE_DONE</name>
                  <value>111</value>
                  <description>Autotake event from AUX semaphore, configured by AUX_SMPH:AUTOTAKE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER1_EV</name>
                  <value>110</value>
                  <description>AUX timer 1 event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.TIMER1_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER0_EV</name>
                  <value>109</value>
                  <description>AUX timer 0 event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.TIMER0_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TDC_DONE</name>
                  <value>108</value>
                  <description>AUX TDC measurement done event, corresponds to the flag AUX_EVCTL:EVTOMCUFLAGS.TDC_DONE and the AUX_TDC status AUX_TDC:STAT.DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <value>107</value>
                  <description>AUX Compare B event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <value>106</value>
                  <description>AUX Compare A event, corresponds to AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_AON_WU_EV</name>
                  <value>105</value>
                  <description>AON wakeup event, corresponds flags are here AUX_EVCTL:EVTOMCUFLAGS.AON_WU_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRNG_IRQ</name>
                  <value>104</value>
                  <description>TRNG Interrupt event, controlled by TRNG:IRQEN.EN</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWEV3</name>
                  <value>103</value>
                  <description>Software event 3, triggered by SWEV.SWEV3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWEV2</name>
                  <value>102</value>
                  <description>Software event 2, triggered by SWEV.SWEV2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWEV1</name>
                  <value>101</value>
                  <description>Software event 1, triggered by SWEV.SWEV1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWEV0</name>
                  <value>100</value>
                  <description>Software event 0, triggered by SWEV.SWEV0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT_NMI</name>
                  <value>99</value>
                  <description>Watchdog non maskable interrupt event, controlled by WDT:CTL.INTTYPE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYPTO_DMA_DONE_IRQ</name>
                  <value>94</value>
                  <description>CRYPTO DMA input done event, the correspondingg flag is CRYPTO:IRQSTAT.DMA_IN_DONE. Controlled by CRYPTO:IRQEN.DMA_IN_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYPTO_RESULT_AVAIL_IRQ</name>
                  <value>93</value>
                  <description>CRYPTO result available interupt event, the corresponding flag is found here CRYPTO:IRQSTAT.RESULT_AVAIL. Controlled by CRYPTO:IRQSTAT.RESULT_AVAIL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT7</name>
                  <value>92</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT7 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT6</name>
                  <value>91</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT6 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT5</name>
                  <value>90</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT4 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT4</name>
                  <value>89</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT4 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT3</name>
                  <value>88</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT3 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT2</name>
                  <value>87</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT2 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT1</name>
                  <value>86</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT1 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_EVENT0</name>
                  <value>85</value>
                  <description>Port capture event from IOC, configured by IOC:IOCFGn.PORT_ID. Events on ports configured with ENUM PORT_EVENT0 wil be routed here.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <value>84</value>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <value>83</value>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <value>82</value>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <value>81</value>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <value>80</value>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <value>79</value>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <value>78</value>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <value>77</value>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_CMP</name>
                  <value>68</value>
                  <description>GPT3B compare event. Configured by GPT3:TBMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_CMP</name>
                  <value>67</value>
                  <description>GPT3A compare event. Configured by GPT3:TAMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_CMP</name>
                  <value>66</value>
                  <description>GPT2B compare event. Configured by GPT2:TBMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_CMP</name>
                  <value>65</value>
                  <description>GPT2A compare event. Configured by GPT2:TAMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_CMP</name>
                  <value>64</value>
                  <description>GPT1B compare event. Configured by GPT1:TBMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_CMP</name>
                  <value>63</value>
                  <description>GPT1A compare event. Configured by GPT1:TAMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_CMP</name>
                  <value>62</value>
                  <description>GPT0B compare event. Configured by GPT0:TBMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_CMP</name>
                  <value>61</value>
                  <description>GPT0A compare event. Configured by GPT0:TAMR.TCACT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TX_DMASREQ</name>
                  <value>51</value>
                  <description>UART0 TX DMA single request, controlled by UART0:DMACTL.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_TX_DMABREQ</name>
                  <value>50</value>
                  <description>UART0 TX DMA burst request, controlled by UART0:DMACTL.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RX_DMASREQ</name>
                  <value>49</value>
                  <description>UART0 RX DMA single request, controlled by UART0:DMACTL.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RX_DMABREQ</name>
                  <value>48</value>
                  <description>UART0 RX DMA burst request, controlled by UART0:DMACTL.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI1_TX_DMASREQ</name>
                  <value>47</value>
                  <description>SSI1 TX DMA single request, controlled by SSI0:DMACR.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI1_TX_DMABREQ</name>
                  <value>46</value>
                  <description>SSI1 TX DMA burst request , controlled by SSI0:DMACR.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI1_RX_DMASREQ</name>
                  <value>45</value>
                  <description>SSI1 RX DMA single request, controlled by SSI0:DMACR.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI1_RX_DMABREQ</name>
                  <value>44</value>
                  <description>SSI1 RX DMA burst request , controlled by SSI0:DMACR.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_TX_DMASREQ</name>
                  <value>43</value>
                  <description>SSI0 TX DMA single request, controlled by SSI0:DMACR.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_TX_DMABREQ</name>
                  <value>42</value>
                  <description>SSI0 TX DMA burst request , controlled by SSI0:DMACR.TXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_RX_DMASREQ</name>
                  <value>41</value>
                  <description>SSI0 RX DMA single request, controlled by SSI0:DMACR.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_RX_DMABREQ</name>
                  <value>40</value>
                  <description>SSI0 RX DMA burst request , controlled by SSI0:DMACR.RXDMAE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_DONE_COMB</name>
                  <value>39</value>
                  <description>Combined DMA done, corresponding flags are here UDMA0:REQDONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_ERR</name>
                  <value>38</value>
                  <description>DMA bus error, corresponds to UDMA0:ERROR.STATUS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_COMB</name>
                  <value>36</value>
                  <description>UART0 combined interrupt, interrupt flags are found here UART0:MIS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI1_COMB</name>
                  <value>35</value>
                  <description>SSI1 combined interrupt, interrupt flags are found here SSI1:MIS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0_COMB</name>
                  <value>34</value>
                  <description>SSI0 combined interrupt, interrupt flags are found here SSI0:MIS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_CPE_1</name>
                  <value>30</value>
                  <description>Combined Interrupt for CPE Generated events. Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected with CPE1 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_1 event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SWEV1</name>
                  <value>29</value>
                  <description>AUX software event 1, triggered by AUX_EVCTL:SWEVSET.SWEV1, also available as AUX_EVENT2 AON wake up event.
MCU domain wakeup control AON_EVENT:MCUWUSEL
AUX domain wakeup control AON_EVENT:AUXWUSEL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_CPE_0</name>
                  <value>27</value>
                  <description>Combined Interrupt for CPE Generated events. Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected with CPE0 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_0 event</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_HW_COMB</name>
                  <value>26</value>
                  <description>Combined RFC hardware interrupt, corresponding flag is here RFC_DBELL:RFHWIFG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFC_CMD_ACK</name>
                  <value>25</value>
                  <description>RFC Doorbell Command Acknowledgement Interrupt, equvialent to RFC_DBELL:RFACKIFG.ACKFLAG</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT_IRQ</name>
                  <value>24</value>
                  <description>Watchdog interrupt event, controlled by WDT:CTL.INTEN</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_CH18_DONE</name>
                  <value>22</value>
                  <description>DMA done for software tiggered UDMA channel 18, see UDMA0:SOFTREQ</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH</name>
                  <value>21</value>
                  <description>FLASH controller error event,  the status flags are FLASH:FEDACSTAT.FSM_DONE and FLASH:FEDACSTAT.RVF_INT</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_CH0_DONE</name>
                  <value>20</value>
                  <description>DMA done for software tiggered UDMA channel 0, see UDMA0:SOFTREQ</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B</name>
                  <value>19</value>
                  <description>GPT1B interrupt event, controlled by GPT1:TBMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A</name>
                  <value>18</value>
                  <description>GPT1A interrupt event, controlled by GPT1:TAMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B</name>
                  <value>17</value>
                  <description>GPT0B interrupt event, controlled by GPT0:TBMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A</name>
                  <value>16</value>
                  <description>GPT0A interrupt event, controlled by GPT0:TAMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B</name>
                  <value>15</value>
                  <description>GPT3B interrupt event, controlled by GPT3:TBMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A</name>
                  <value>14</value>
                  <description>GPT3A interrupt event, controlled by GPT3:TAMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B</name>
                  <value>13</value>
                  <description>GPT2B interrupt event, controlled by GPT2:TBMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A</name>
                  <value>12</value>
                  <description>GPT2A interrupt event, controlled by GPT2:TAMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMB</name>
                  <value>11</value>
                  <description>AUX combined event, the corresponding flag register is here AUX_EVCTL:EVTOMCUFLAGS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_AUX_SWEV0</name>
                  <value>10</value>
                  <description>AUX Software event 0, AUX_EVCTL:SWEVSET.SWEV0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_IRQ</name>
                  <value>9</value>
                  <description>Interrupt event from I2C</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_IRQ</name>
                  <value>8</value>
                  <description>Interrupt event from I2S</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_COMB</name>
                  <value>7</value>
                  <description>Event from AON_RTC, controlled by the AON_RTC:CTL.COMB_EV_MASK setting</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_GPIO_EDGE</name>
                  <value>4</value>
                  <description>Edge detect event from IOC. Configureded by the IOC:IOCFGn.EDGE_IRQ_EN and  IOC:IOCFGn.EDGE_DET settings</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG2</name>
                  <value>3</value>
