eduxstad/cc1310f128-rs/cc1310f128.svd
        <register>
          <name>MISC_OTP_DATA_1</name>
          <addressOffset>0x398</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:29] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>PEAK_DET_ITRIM</name>
              <description>[28:27] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>HP_BUF_ITRIM</name>
              <description>[26:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>LP_BUF_ITRIM</name>
              <description>[23:22] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>DBLR_LOOP_FILTER_RESET_VOLTAGE</name>
              <description>[21:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>HPM_IBIAS_WAIT_CNT</name>
              <description>[19:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>10</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>LPM_IBIAS_WAIT_CNT</name>
              <description>[9:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>IDAC_STEP</name>
              <description>[3:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xE00403F8</resetValue>
        </register>
        <register>
          <name>PWD_CURR_20C</name>
          <addressOffset>0x39c</addressOffset>
          <size>32</size>
          <description>Power Down Current Control 20C</description>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>[31:24] Additional maximum current, in units of 1uA, with cache retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>[23:16] Additional maximum current, in 1uA units, with RF memory retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>[15:8] Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BASELINE</name>
              <description>[7:0] Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x80BA608</resetValue>
        </register>
        <register>
          <name>PWD_CURR_35C</name>
          <addressOffset>0x3a0</addressOffset>
          <size>32</size>
          <description>Power Down Current Control 35C</description>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>[31:24] Additional maximum current, in units of 1uA, with cache retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>[23:16] Additional maximum current, in 1uA units, with RF memory retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>[15:8] Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BASELINE</name>
              <description>[7:0] Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xC10A50A</resetValue>
        </register>
        <register>
          <name>PWD_CURR_50C</name>
          <addressOffset>0x3a4</addressOffset>
          <size>32</size>
          <description>Power Down Current Control 50C</description>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>[31:24] Additional maximum current, in units of 1uA, with cache retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>[23:16] Additional maximum current, in 1uA units, with RF memory retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>[15:8] Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BASELINE</name>
              <description>[7:0] Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1218A20D</resetValue>
        </register>
        <register>
          <name>PWD_CURR_65C</name>
          <addressOffset>0x3a8</addressOffset>
          <size>32</size>
          <description>Power Down Current Control 65C</description>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>[31:24] Additional maximum current, in units of 1uA, with cache retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>[23:16] Additional maximum current, in 1uA units, with RF memory retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>[15:8] Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BASELINE</name>
              <description>[7:0] Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1C259C14</resetValue>
        </register>
        <register>
          <name>PWD_CURR_80C</name>
          <addressOffset>0x3ac</addressOffset>
          <size>32</size>
          <description>Power Down Current Control 80C</description>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>[31:24] Additional maximum current, in units of 1uA, with cache retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>[23:16] Additional maximum current, in 1uA units, with RF memory retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>[15:8] Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BASELINE</name>
              <description>[7:0] Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x2E3B9021</resetValue>
        </register>
        <register>
          <name>PWD_CURR_95C</name>
          <addressOffset>0x3b0</addressOffset>
          <size>32</size>
          <description>Power Down Current Control 95C</description>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>[31:24] Additional maximum current, in units of 1uA, with cache retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>[23:16] Additional maximum current, in 1uA units, with RF memory retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>[15:8] Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BASELINE</name>
              <description>[7:0] Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x4C627A3B</resetValue>
        </register>
        <register>
          <name>PWD_CURR_110C</name>
          <addressOffset>0x3b4</addressOffset>
          <size>32</size>
          <description>Power Down Current Control 110C</description>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>[31:24] Additional maximum current, in units of 1uA, with cache retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>[23:16] Additional maximum current, in 1uA units, with RF memory retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>[15:8] Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BASELINE</name>
              <description>[7:0] Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x789E706B</resetValue>
        </register>
        <register>
          <name>PWD_CURR_125C</name>
          <addressOffset>0x3b8</addressOffset>
          <size>32</size>
          <description>Power Down Current Control 125C</description>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>[31:24] Additional maximum current, in units of 1uA, with cache retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>[23:16] Additional maximum current, in 1uA units, with RF memory retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>[15:8] Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BASELINE</name>
              <description>[7:0] Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xADE1809A</resetValue>
        </register>
