eduxstad/cc1310f128-rs/cc1310f128.svd
        <register>
          <name>FSM_ACC_EP</name>
          <addressOffset>0x2290</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>ACC_EP</name>
              <description>[15:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_ADDR</name>
          <addressOffset>0x22a0</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED31</name>
              <description>[31:31] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>BANK</name>
              <description>[30:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>CUR_ADDR</name>
              <description>[27:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_SECTOR</name>
          <addressOffset>0x22a4</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>SECT_ERASED</name>
              <description>[31:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>FSM_SECTOR_EXTENSION</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SECTOR</name>
              <description>[7:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SEC_OUT</name>
              <description>[3:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFF0000</resetValue>
        </register>
        <register>
          <name>FMC_REV_ID</name>
          <addressOffset>0x22a8</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>MOD_VERSION</name>
              <description>[31:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>CONFIG_CRC</name>
              <description>[11:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_ERR_ADDR</name>
          <addressOffset>0x22ac</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>FSM_ERR_ADDR</name>
              <description>[31:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[7:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>FSM_ERR_BANK</name>
              <description>[3:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_PGM_MAXPUL</name>
          <addressOffset>0x22b0</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>[31:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>FSM_PGM_MAXPUL</name>
              <description>[11:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_EXECUTE</name>
          <addressOffset>0x22b4</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>[31:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>SUSPEND_NOW</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED5</name>
              <description>[15:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>11</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>FSMEXECUTE</name>
              <description>[4:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xA000A</resetValue>
        </register>
        <register>
          <name>EEPROM_CFG</name>
          <addressOffset>0x22b8</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>AUTOSTART_GRACE</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x10000</resetValue>
        </register>
        <register>
          <name>FSM_SECTOR1</name>
          <addressOffset>0x22c0</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>FSM_SECTOR1</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>FSM_SECTOR2</name>
          <addressOffset>0x22c4</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>FSM_SECTOR2</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_BSLE0</name>
          <addressOffset>0x22e0</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>FSM_BSLE0</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_BSLE1</name>
          <addressOffset>0x22e4</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>FSM_BSL1</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_BSLP0</name>
          <addressOffset>0x22f0</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>FSM_BSLP0</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FSM_BSLP1</name>
          <addressOffset>0x22f4</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>FSM_BSL1</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_BANK</name>
          <addressOffset>0x2400</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>EE_BANK_WIDTH</name>
              <description>[31:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>EE_NUM_BANK</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>MAIN_BANK_WIDTH</name>
              <description>[15:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MAIN_NUM_BANK</name>
              <description>[3:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x401</resetValue>
        </register>
        <register>
          <name>FCFG_WRAPPER</name>
          <addressOffset>0x2404</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>FAMILY_TYPE</name>
              <description>[31:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED21</name>
              <description>[23:21] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>MEM_MAP</name>
              <description>[20:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>CPU2</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>EE_IN_MAIN</name>
              <description>[15:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>ROM</name>
              <description>[11:11] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>IFLUSH</name>
              <description>[10:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>SIL3</name>
              <description>[9:9] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>ECCA</name>
              <description>[8:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AUTO_SUSP</name>
              <description>[7:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>UERR</name>
              <description>[5:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CPU_TYPE1</name>
              <description>[3:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x50009007</resetValue>
        </register>
        <register>
          <name>FCFG_BNK_TYPE</name>
          <addressOffset>0x2408</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>B7_TYPE</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>B6_TYPE</name>
              <description>[27:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>B5_TYPE</name>
              <description>[23:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>B4_TYPE</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>B3_TYPE</name>
              <description>[15:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>B2_TYPE</name>
              <description>[11:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>B1_TYPE</name>
              <description>[7:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>B0_TYPE</name>
              <description>[3:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x3</resetValue>
        </register>
        <register>
          <name>FCFG_B0_START</name>
          <addressOffset>0x2410</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>B0_MAX_SECTOR</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>B0_MUX_FACTOR</name>
              <description>[27:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>B0_START_ADDR</name>
              <description>[23:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x2000000</resetValue>
        </register>
        <register>
          <name>FCFG_B1_START</name>
          <addressOffset>0x2414</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>B1_MAX_SECTOR</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>B1_MUX_FACTOR</name>
              <description>[27:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>B1_START_ADDR</name>
              <description>[23:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B2_START</name>
          <addressOffset>0x2418</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>B2_MAX_SECTOR</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>B2_MUX_FACTOR</name>
              <description>[27:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>B2_START_ADDR</name>
              <description>[23:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B3_START</name>
          <addressOffset>0x241c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>B3_MAX_SECTOR</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>B3_MUX_FACTOR</name>
              <description>[27:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>B3_START_ADDR</name>
              <description>[23:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FCFG_B4_START</name>
          <addressOffset>0x2420</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>B4_MAX_SECTOR</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>B4_MUX_FACTOR</name>
              <description>[27:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>B4_START_ADDR</name>
              <description>[23:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
