eduxstad/cc1310f128-rs/cc1310f128.svd
This interrupt asserts when the subtimer is configured in Input Edge-Time mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>CBMRIS</name>
              <description>[9:9] GPT Timer B Capture Mode Match Raw Interrupt

0:  The capture mode match for Timer B has not occurred.
1:  A capture mode match has occurred for Timer B. This interrupt
asserts when the values in the TBR and TBPR
match the values in the TBMATCHR and TBPMR
when configured in Input Edge-Time mode.

This bit is cleared by writing a 1 to the ICLR.CBMCINT bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>TBTORIS</name>
              <description>[8:8] GPT Timer B Time-out Raw Interrupt

0:  Timer B has not timed out
1:  Timer B has timed out. 

This interrupt is asserted when a one-shot or periodic mode timer reaches its count limit. The count limit is 0 or the value loaded into TBILR, depending on the count direction.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[7:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>DMAARIS</name>
              <description>[5:5] GPT Timer A DMA Done Raw Interrupt Status

0: Transfer has not completed
1: Transfer has completed</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>TAMRIS</name>
              <description>[4:4] GPT Timer A Match Raw  Interrupt

0:  The match value has not been reached
1:  The match value is reached.

TAMR.TAMIE is set, and the match values in TAMATCHR and optionally TAPMR have been reached when configured in one-shot or periodic mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[3:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CAERIS</name>
              <description>[2:2] GPT Timer A Capture Mode Event Raw Interrupt

0:  The event has not occured.
1:  The event has occured.

This interrupt asserts when the subtimer is configured in Input Edge-Time mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CAMRIS</name>
              <description>[1:1] GPT Timer A Capture Mode Match Raw Interrupt

0:  The capture mode match for Timer A has not occurred.
1:  A capture mode match has occurred for Timer A. This interrupt
asserts when the values in the TAR and TAPR
match the values in the TAMATCHR and TAPMR
when configured in Input Edge-Time mode.

This bit is cleared by writing a 1 to the ICLR.CAMCINT bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>TATORIS</name>
              <description>[0:0] GPT Timer A Time-out Raw Interrupt

0:  Timer A has not timed out
1:  Timer A has timed out. 

This interrupt is asserted when a one-shot or periodic mode timer reaches its count limit. The count limit is 0 or the value loaded into TAILR, depending on the count direction.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MIS</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Masked Interrupt Status
Values are result of bitwise AND operation between RIS and IMR
Assosciated clear register: ICLR</description>
          <fields>
            <field>
              <name>RESERVED14</name>
              <description>[31:14] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>DMABMIS</name>
              <description>[13:13] 0: No interrupt or interrupt not enabled
1: RIS.DMABRIS = 1 &amp;&amp; IMR.DMABIM = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[12:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>TBMMIS</name>
              <description>[11:11] 0: No interrupt or interrupt not enabled
1: RIS.TBMRIS = 1 &amp;&amp; IMR.TBMIM = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>CBEMIS</name>
              <description>[10:10] 0: No interrupt or interrupt not enabled
1: RIS.CBERIS = 1 &amp;&amp; IMR.CBEIM = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>CBMMIS</name>
              <description>[9:9] 0: No interrupt or interrupt not enabled
1: RIS.CBMRIS = 1 &amp;&amp; IMR.CBMIM = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>TBTOMIS</name>
              <description>[8:8] 0: No interrupt or interrupt not enabled
1: RIS.TBTORIS = 1 &amp;&amp; IMR.TBTOIM = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[7:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>DMAAMIS</name>
              <description>[5:5] 0: No interrupt or interrupt not enabled
1: RIS.DMAARIS = 1 &amp;&amp; IMR.DMAAIM = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>TAMMIS</name>
              <description>[4:4] 0: No interrupt or interrupt not enabled
1: RIS.TAMRIS = 1 &amp;&amp; IMR.TAMIM = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[3:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CAEMIS</name>
              <description>[2:2] 0: No interrupt or interrupt not enabled
1: RIS.CAERIS = 1 &amp;&amp; IMR.CAEIM = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CAMMIS</name>
              <description>[1:1] 0: No interrupt or interrupt not enabled
1: RIS.CAMRIS = 1 &amp;&amp; IMR.CAMIM = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>TATOMIS</name>
              <description>[0:0] 0: No interrupt or interrupt not enabled
1: RIS.TATORIS = 1 &amp;&amp; IMR.TATOIM = 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ICLR</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Interrupt Clear
This register is used to clear status bits in the RIS and MIS registers</description>
          <fields>
            <field>
              <name>RESERVED14</name>
              <description>[31:14] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>DMABINT</name>
              <description>[13:13] 0: Do nothing.
1: Clear RIS.DMABRIS and MIS.DMABMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[12:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>TBMCINT</name>
              <description>[11:11] 0: Do nothing.
1: Clear RIS.TBMRIS and MIS.TBMMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>CBECINT</name>
              <description>[10:10] 0: Do nothing.
1: Clear RIS.CBERIS and MIS.CBEMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>CBMCINT</name>
              <description>[9:9] 0: Do nothing.
1: Clear RIS.CBMRIS and MIS.CBMMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>TBTOCINT</name>
              <description>[8:8] 0: Do nothing.
1: Clear RIS.TBTORIS and MIS.TBTOMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[7:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>DMAAINT</name>
              <description>[5:5] 0: Do nothing.
1: Clear RIS.DMAARIS and MIS.DMAAMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>TAMCINT</name>
              <description>[4:4] 0: Do nothing.
1: Clear RIS.TAMRIS and MIS.TAMMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[3:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CAECINT</name>
              <description>[2:2] 0: Do nothing.
1: Clear RIS.CAERIS and MIS.CAEMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CAMCINT</name>
              <description>[1:1] 0: Do nothing.
1: Clear RIS.CAMRIS and MIS.CAMMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>TATOCINT</name>
              <description>[0:0] 0: Do nothing.
1: Clear RIS.TATORIS and MIS.TATOMIS</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TAILR</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Timer A Interval Load  Register</description>
          <fields>
            <field>
              <name>TAILR</name>
              <description>[31:0] GPT Timer A Interval Load  Register

Writing this field loads the counter for Timer A. A read returns the current value of TAILR.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>TBILR</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Timer B Interval Load  Register</description>
          <fields>
            <field>
              <name>TBILR</name>
              <description>[31:0] GPT Timer B Interval Load  Register

Writing this field loads the counter for Timer B. A read returns the current value of TBILR.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFF</resetValue>
        </register>
        <register>
          <name>TAMATCHR</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Timer A Match Register

Interrupts can be generated when the timer value is equal to the value in this register in one-shot or periodic mode.

In Edge-Count mode, this register along with TAILR, determines how many edge events are counted.
The total number of edge events counted is equal to the value in TAILR minus this value.

Note that in edge-count mode, when executing an up-count, the value of TAPR and TAILR must be greater than the value of TAPMR and this register.

In PWM mode, this value along with TAILR, determines the duty cycle of the output PWM signal.

When a 16/32-bit GPT is configured to one of the 32-bit modes, TAMATCHR appears as a 32-bit register. (The upper 16-bits correspond to the contents TBMATCHR).

