eduxstad/cc1310f128-rs/cc1310f128.svd
Warm reset sources included:
ICEPick sysreset
System CPU reset request, CPU_SCS:AIRCR.SYSRESETREQ
System CPU Lockup
WDT timeout 

An active ICEPick block system reset will gate all sources except ICEPick sysreset

SW can read AON_SYSCTL:RESETCTL.RESET_SRC to find the source of the last reset resulting in a full power up sequence. WARMRESET in this register is set in the scenario that WR_TO_PINRESET=1 and one of the above listed sources is triggered.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>LOCKUP_STAT</name>
              <description>[1:1] 0: No registred event
1: A system CPU LOCKUP event has occured since last SW clear of the register.

A read of this register clears both  WDT_STAT and LOCKUP_STAT.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>WDT_STAT</name>
              <description>[0:0] 0: No registered event
1: A WDT event has occured since last SW clear of the register.

A read of this register clears both WDT_STAT and LOCKUP_STAT.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL0</name>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <description>Power Domain Control</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PERIPH_ON</name>
              <description>[2:2] PERIPH Power domain.

0: PERIPH power domain is powered down
1: PERIPH power domain is powered up</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SERIAL_ON</name>
              <description>[1:1] SERIAL Power domain.

0: SERIAL power domain is powered down
1: SERIAL power domain is powered up</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>[0:0] 0: RFC power domain powered off if also PDCTL1.RFC_ON = 0
1: RFC power domain powered on</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL0RFC</name>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <description>RFC Power Domain Control</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDCTL0.RFC_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL0SERIAL</name>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <description>SERIAL Power Domain Control</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDCTL0.SERIAL_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL0PERIPH</name>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <description>PERIPH Power Domain Control</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDCTL0.PERIPH_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT0</name>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <description>Power Domain Status</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PERIPH_ON</name>
              <description>[2:2] PERIPH Power domain.

0: Domain may be powered down
1: Domain powered up (guaranteed)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SERIAL_ON</name>
              <description>[1:1] SERIAL Power domain.

0: Domain may be powered down
1: Domain powered up (guaranteed)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>[0:0] RFC Power domain

0: Domain may be powered down
1: Domain powered up (guaranteed)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT0RFC</name>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <description>RFC Power Domain Status</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDSTAT0.RFC_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT0SERIAL</name>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <description>SERIAL Power Domain Status</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDSTAT0.SERIAL_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT0PERIPH</name>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <description>PERIPH Power Domain Status</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDSTAT0.PERIPH_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL1</name>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <description>Power Domain Control</description>
          <fields>
            <field>
              <name>RESERVED5</name>
              <description>[31:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[4:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>VIMS_MODE</name>
              <description>[3:3] 0: VIMS power domain is only powered when CPU power domain is powered.
1: VIMS power domain is powered whenever the BUS power domain is powered.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>[2:2] 0: RFC power domain powered off if also PDCTL0.RFC_ON = 0
1: RFC power domain powered on

Bit shall be used by RFC in autonomus mode but there is no HW restrictions fom system CPU to access the bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CPU_ON</name>
              <description>[1:1] 0: Causes a power down of the CPU power domain when system CPU indicates it is idle. 
1: Initiates power-on of the CPU power domain.

This bit is automatically set by a WIC power-on event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xA</resetValue>
        </register>
        <register>
          <name>PDCTL1CPU</name>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <description>CPU Power Domain Direct Control</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDCTL1.CPU_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PDCTL1RFC</name>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <description>RFC Power Domain Direct Control</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDCTL1.RFC_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL1VIMS</name>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <description>VIMS Mode Direct Control</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDCTL1.VIMS_MODE</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PDSTAT1</name>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <description>Power Manager Status</description>
          <fields>
            <field>
              <name>RESERVED5</name>
              <description>[31:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>BUS_ON</name>
              <description>[4:4] 0: BUS domain not accessible
1: BUS domain is currently accessible</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>VIMS_MODE</name>
              <description>[3:3] 0: VIMS domain not accessible
1: VIMS domain is currently accessible</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>[2:2] 0: RFC domain not accessible
1: RFC domain is currently accessible</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CPU_ON</name>
              <description>[1:1] 0: CPU and BUS domain not accessible
1: CPU and BUS domains are both currently accessible</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1A</resetValue>
        </register>
        <register>
          <name>PDSTAT1BUS</name>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <description>BUS Power Domain Direct Read Status</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDSTAT1.BUS_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PDSTAT1RFC</name>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <description>RFC Power Domain Direct Read Status</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDSTAT1.RFC_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT1CPU</name>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <description>CPU Power Domain Direct Read Status</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDSTAT1.CPU_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PDSTAT1VIMS</name>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <description>VIMS Mode Direct Read Status</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDSTAT1.VIMS_MODE</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>RFCBITS</name>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <description>Control To RFC</description>
          <fields>
            <field>
              <name>READ</name>
              <description>[31:0] Control bits for RFC. The RF core CPE processor will automatically check this register when it boots, and it can be used to immediately instruct CPE to perform some tasks at its start-up. The supported functionality is ROM-defined and may vary. See the technical reference manual for more details.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RFCMODESEL</name>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <description>Selected RFC Mode</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CURR</name>
              <description>[2:0] Selects the set of commands that the RFC will accept. Only modes permitted by RFCMODEHWOPT.AVAIL are writeable. See the technical reference manual for details.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE7</name>
                  <value>7</value>
                  <description>Select Mode 7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE6</name>
                  <value>6</value>
                  <description>Select Mode 6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE5</name>
                  <value>5</value>
                  <description>Select Mode 5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE4</name>
                  <value>4</value>
                  <description>Select Mode 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <value>3</value>
                  <description>Select Mode 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <value>2</value>
                  <description>Select Mode 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <value>1</value>
                  <description>Select Mode 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE0</name>
                  <value>0</value>
                  <description>Select Mode 0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
