eduxstad/cc1310f128-rs/cc1310f128.svd
              </enumeratedValues>
            </field>
            <field>
              <name>LAST_FG_COMMAND_DONE</name>
              <description>[3:3] Select which CPU interrupt vector the RFCPEIFG.LAST_FG_COMMAND_DONE interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FG_COMMAND_DONE</name>
              <description>[2:2] Select which CPU interrupt vector the RFCPEIFG.FG_COMMAND_DONE interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAST_COMMAND_DONE</name>
              <description>[1:1] Select which CPU interrupt vector the RFCPEIFG.LAST_COMMAND_DONE interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMMAND_DONE</name>
              <description>[0:0] Select which CPU interrupt vector the RFCPEIFG.COMMAND_DONE interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0xFFFF0000</resetValue>
        </register>
        <register>
          <name>RFACKIFG</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Doorbell Command Acknowledgement Interrupt Flag</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ACKFLAG</name>
              <description>[0:0] Interrupt flag for Command ACK</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SYSGPOCTL</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>RF Core General Purpose Output Control</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>GPOCTL3</name>
              <description>[15:12] RF Core GPO control bit 3. Selects which signal to output on the RF Core GPO line 3.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RATGPO3</name>
                  <value>15</value>
                  <description>RAT GPO line 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO2</name>
                  <value>14</value>
                  <description>RAT GPO line 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO1</name>
                  <value>13</value>
                  <description>RAT GPO line 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO0</name>
                  <value>12</value>
                  <description>RAT GPO line 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO3</name>
                  <value>11</value>
                  <description>RFE GPO line 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO2</name>
                  <value>10</value>
                  <description>RFE GPO line 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO1</name>
                  <value>9</value>
                  <description>RFE GPO line 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO0</name>
                  <value>8</value>
                  <description>RFE GPO line 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO3</name>
                  <value>7</value>
                  <description>MCE GPO line 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO2</name>
                  <value>6</value>
                  <description>MCE GPO line 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO1</name>
                  <value>5</value>
                  <description>MCE GPO line 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO0</name>
                  <value>4</value>
                  <description>MCE GPO line 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO3</name>
                  <value>3</value>
                  <description>CPE GPO line 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO2</name>
                  <value>2</value>
                  <description>CPE GPO line 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO1</name>
                  <value>1</value>
                  <description>CPE GPO line 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO0</name>
                  <value>0</value>
                  <description>CPE GPO line 0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPOCTL2</name>
              <description>[11:8] RF Core GPO control bit 2. Selects which signal to output on the RF Core GPO line 2.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RATGPO3</name>
                  <value>15</value>
                  <description>RAT GPO line 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO2</name>
                  <value>14</value>
                  <description>RAT GPO line 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO1</name>
                  <value>13</value>
                  <description>RAT GPO line 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO0</name>
                  <value>12</value>
                  <description>RAT GPO line 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO3</name>
                  <value>11</value>
                  <description>RFE GPO line 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO2</name>
                  <value>10</value>
                  <description>RFE GPO line 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO1</name>
                  <value>9</value>
                  <description>RFE GPO line 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO0</name>
                  <value>8</value>
                  <description>RFE GPO line 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO3</name>
                  <value>7</value>
                  <description>MCE GPO line 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO2</name>
                  <value>6</value>
                  <description>MCE GPO line 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO1</name>
                  <value>5</value>
                  <description>MCE GPO line 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO0</name>
                  <value>4</value>
                  <description>MCE GPO line 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO3</name>
                  <value>3</value>
                  <description>CPE GPO line 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO2</name>
                  <value>2</value>
                  <description>CPE GPO line 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO1</name>
                  <value>1</value>
                  <description>CPE GPO line 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO0</name>
                  <value>0</value>
                  <description>CPE GPO line 0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPOCTL1</name>
              <description>[7:4] RF Core GPO control bit 1. Selects which signal to output on the RF Core GPO line 1.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RATGPO3</name>
                  <value>15</value>
                  <description>RAT GPO line 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO2</name>
                  <value>14</value>
                  <description>RAT GPO line 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO1</name>
                  <value>13</value>
                  <description>RAT GPO line 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO0</name>
                  <value>12</value>
                  <description>RAT GPO line 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO3</name>
                  <value>11</value>
                  <description>RFE GPO line 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO2</name>
                  <value>10</value>
                  <description>RFE GPO line 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO1</name>
                  <value>9</value>
                  <description>RFE GPO line 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO0</name>
                  <value>8</value>
                  <description>RFE GPO line 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO3</name>
                  <value>7</value>
                  <description>MCE GPO line 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO2</name>
                  <value>6</value>
                  <description>MCE GPO line 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO1</name>
                  <value>5</value>
                  <description>MCE GPO line 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO0</name>
                  <value>4</value>
                  <description>MCE GPO line 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO3</name>
                  <value>3</value>
                  <description>CPE GPO line 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO2</name>
                  <value>2</value>
                  <description>CPE GPO line 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO1</name>
                  <value>1</value>
                  <description>CPE GPO line 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO0</name>
                  <value>0</value>
                  <description>CPE GPO line 0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPOCTL0</name>
              <description>[3:0] RF Core GPO control bit 0. Selects which signal to output on the RF Core GPO line 0.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RATGPO3</name>
                  <value>15</value>
                  <description>RAT GPO line 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO2</name>
                  <value>14</value>
                  <description>RAT GPO line 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO1</name>
                  <value>13</value>
                  <description>RAT GPO line 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATGPO0</name>
                  <value>12</value>
                  <description>RAT GPO line 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO3</name>
                  <value>11</value>
                  <description>RFE GPO line 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO2</name>
                  <value>10</value>
                  <description>RFE GPO line 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO1</name>
                  <value>9</value>
                  <description>RFE GPO line 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFEGPO0</name>
                  <value>8</value>
                  <description>RFE GPO line 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO3</name>
                  <value>7</value>
                  <description>MCE GPO line 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO2</name>
                  <value>6</value>
                  <description>MCE GPO line 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO1</name>
                  <value>5</value>
                  <description>MCE GPO line 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCEGPO0</name>
                  <value>4</value>
                  <description>MCE GPO line 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO3</name>
                  <value>3</value>
                  <description>CPE GPO line 3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO2</name>
                  <value>2</value>
                  <description>CPE GPO line 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO1</name>
                  <value>1</value>
                  <description>CPE GPO line 1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPEGPO0</name>
                  <value>0</value>
                  <description>CPE GPO line 0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
