eduxstad/cc1310f128-rs/cc1310f128.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SMPH</name>
      <baseAddress>0x40084000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>MCU Semaphore Module

This module provides 32 binary semaphores. The state of a binary semaphore is either taken or available. 

A semaphore does not implement any ownership attribute. Still, a semaphore can be used to handle mutual exclusion scenarios.</description>
      <registers>
        <register>
          <name>SMPH0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 0</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH1</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 1</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH2</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 2</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH3</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 3</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH4</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 4</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH5</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 5</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH6</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 6</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH7</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 7</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH8</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 8</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH9</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 9</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH10</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 10</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH11</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 11</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH12</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 12</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH13</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 13</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH14</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 14</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH15</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 15</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH16</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 16</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH17</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 17</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH18</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 18</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH19</name>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 19</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH20</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 20</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH21</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 21</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH22</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 22</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH23</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 23</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
