eduxstad/cc1310f128-rs/cc1310f128.svd
        <register>
          <name>RIS</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Raw Interrupt Status</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>TXRIS</name>
              <description>[3:3] Raw transmit FIFO interrupt status:
The transmit interrupt is asserted when there are four or fewer valid entries in the transmit FIFO. The transmit interrupt is not qualified with the SSI enable signal. Therefore one of the following ways can be used:
 - data can be written to the transmit FIFO prior to enabling the SSI and the
interrupts.
 - SSI and interrupts can be enabled so that data can be written to the transmit FIFO by an interrupt service routine.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RXRIS</name>
              <description>[2:2] Raw interrupt state of receive FIFO interrupt:
The receive interrupt is asserted when there are four or more valid entries in the receive FIFO.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RTRIS</name>
              <description>[1:1] Raw interrupt state of receive timeout interrupt:
The receive timeout interrupt is asserted when the receive FIFO is not empty and SSI has remained idle for a fixed 32 bit period. This mechanism can be used to notify the user that data is still present in the receive FIFO and requires servicing. This interrupt is deasserted if the receive FIFO becomes empty by subsequent reads, or if new data is received on RXD.
It can also be cleared by writing to ICR.RTIC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RORRIS</name>
              <description>[0:0] Raw interrupt state of receive overrun interrupt:
The receive overrun interrupt is asserted when the FIFO is already full and an additional data frame is received, causing an overrun of the FIFO. Data is over-written in the
receive shift register, but not the FIFO so the FIFO contents stay valid.
It can also be cleared by writing to ICR.RORIC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x8</resetValue>
        </register>
        <register>
          <name>MIS</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Masked Interrupt Status</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>TXMIS</name>
              <description>[3:3] Masked interrupt state of transmit FIFO interrupt:
This field returns the masked interrupt state of transmit FIFO interrupt which is the AND product of raw interrupt state RIS.TXRIS and the mask setting IMSC.TXIM.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RXMIS</name>
              <description>[2:2] Masked interrupt state of receive FIFO interrupt:
This field returns the masked interrupt state of receive FIFO interrupt which is the AND product of raw interrupt state RIS.RXRIS and the mask setting IMSC.RXIM.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RTMIS</name>
              <description>[1:1] Masked interrupt state of receive timeout interrupt:
This field returns the masked interrupt state of receive timeout interrupt which is the AND product of raw interrupt state RIS.RTRIS and the mask setting IMSC.RTIM.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RORMIS</name>
              <description>[0:0] Masked interrupt state of receive overrun interrupt:
This field returns the masked interrupt state of receive overrun interrupt which is the AND product of raw interrupt state RIS.RORRIS and the mask setting IMSC.RORIM.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Interrupt Clear
On a write of 1, the corresponding interrupt is cleared. A write of 0 has no effect.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RTIC</name>
              <description>[1:1] Clear the receive timeout interrupt:
Writing 1 to this field clears the timeout interrupt (RIS.RTRIS). Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RORIC</name>
              <description>[0:0] Clear the receive overrun interrupt:
Writing 1 to this field clears the overrun error interrupt (RIS.RORRIS). Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMACR</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>DMA Control</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TXDMAE</name>
              <description>[1:1] Transmit DMA enable. If this bit is set to 1, DMA for the transmit FIFO is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RXDMAE</name>
              <description>[0:0] Receive DMA enable. If this bit is set to 1, DMA for the receive FIFO is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RESERVED1</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RESERVED2</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
